<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"01f0dfe7cfc24ac9017249d81745a01f0363862b2f45aa65c2f88f3a9321fade","plan_job_ref":"Job Create terraform plan #19 at https://github.com/garettmd/comet/actions/runs/11690408505","plan_out_hash":"2ab2f865b6ff614969b67f3f2c9d326fb5b7f3ad0042f01fd976743b91577574","plan_hash":"d4ee121b8909d8763e875a5b8a366bcd66034496d652c1b80507d792ad4893dd","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
project_id = "comet-project-440416"
region     = "us-central1"
```
</details>
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.firewall.google_compute_firewall.allow-tag-http[0] will be created
+   resource "google_compute_firewall" "allow-tag-http" {
+       creation_timestamp = (known after apply)
+       description        = "Allow http to machines with matching tags."
+       destination_ranges = (known after apply)
+       direction          = (known after apply)
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "gke-network-ingress-tag-http"
+       network            = "gke-network"
+       priority           = 1000
+       project            = "comet-project-440416"
+       self_link          = (known after apply)
+       source_ranges      = [
+           "130.211.0.0/22",
+           "209.85.152.0/22",
+           "209.85.204.0/22",
+           "35.191.0.0/16",
        ]
+       target_tags        = [
+           "http-server",
        ]

+       allow {
+           ports    = [
+               "80",
            ]
+           protocol = "tcp"
        }
    }

  # module.firewall.google_compute_firewall.allow-tag-https[0] will be created
+   resource "google_compute_firewall" "allow-tag-https" {
+       creation_timestamp = (known after apply)
+       description        = "Allow http to machines with matching tags."
+       destination_ranges = (known after apply)
+       direction          = (known after apply)
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "gke-network-ingress-tag-https"
+       network            = "gke-network"
+       priority           = 1000
+       project            = "comet-project-440416"
+       self_link          = (known after apply)
+       source_ranges      = [
+           "130.211.0.0/22",
+           "209.85.152.0/22",
+           "209.85.204.0/22",
+           "35.191.0.0/16",
        ]
+       target_tags        = [
+           "https-server",
        ]

+       allow {
+           ports    = [
+               "443",
            ]
+           protocol = "tcp"
        }
    }

  # module.firewall.google_compute_firewall.allow-tag-ssh[0] will be created
+   resource "google_compute_firewall" "allow-tag-ssh" {
+       creation_timestamp = (known after apply)
+       description        = "Allow SSH to machines with matching tags."
+       destination_ranges = (known after apply)
+       direction          = (known after apply)
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "gke-network-ingress-tag-ssh"
+       network            = "gke-network"
+       priority           = 1000
+       project            = "comet-project-440416"
+       self_link          = (known after apply)
+       source_ranges      = [
+           "35.235.240.0/20",
        ]
+       target_tags        = [
+           "ssh",
        ]

+       allow {
+           ports    = [
+               "22",
            ]
+           protocol = "tcp"
        }
    }

  # module.nat.google_compute_router.router[0] will be created
+   resource "google_compute_router" "router" {
+       creation_timestamp = (known after apply)
+       id                 = (known after apply)
+       name               = "default-nat"
+       network            = "https://www.googleapis.com/compute/v1/projects/comet-project-440416/global/networks/gke-network"
+       project            = "comet-project-440416"
+       region             = "us-central1"
+       self_link          = (known after apply)
    }

  # module.nat.google_compute_router_nat.nat will be created
+   resource "google_compute_router_nat" "nat" {
+       auto_network_tier                   = (known after apply)
+       drain_nat_ips                       = (known after apply)
+       enable_dynamic_port_allocation      = false
+       enable_endpoint_independent_mapping = true
+       endpoint_types                      = (known after apply)
+       icmp_idle_timeout_sec               = 30
+       id                                  = (known after apply)
+       max_ports_per_vm                    = 65536
+       min_ports_per_vm                    = (known after apply)
+       name                                = "default"
+       nat_ip_allocate_option              = "AUTO_ONLY"
+       nat_ips                             = (known after apply)
+       project                             = "comet-project-440416"
+       region                              = "us-central1"
+       router                              = "default-nat"
+       source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
+       tcp_established_idle_timeout_sec    = 1200
+       tcp_time_wait_timeout_sec           = 120
+       tcp_transitory_idle_timeout_sec     = 30
+       type                                = "PUBLIC"
+       udp_idle_timeout_sec                = 30

+       log_config {
+           enable = false
+           filter = "ALL"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Apply terraform plan #6](https://github.com/garettmd/comet/actions/runs/11690455547)